Repository: carrotFoxx/services
Catalog: docs/locale/*/LC_MESSAGES/bdz_installation_manual.po
Languages: ru

source: Prerequisites:
ru: Предусловия:

source: git, ssh, kubectl and helm installed
ru: git, ssh, kubectl и helm установлены

source: downloaded the infrastructure repository from git
ru: репозиторий с исходными кодами и конфигурациями инфарструктуры скачан из git

source: openstack cluster up and running
ru: кластер OpenStack готов к работе

source: kubernetes cluster up and running
ru: кластер Kubernetes готов к работе

source: All commands described in this manual are expected to be run stating at the root of infrastructure repository.
ru: Все команды описаннные в данном мануале предпологается выполнять в корневой папке репозитория

source: Preparations
ru: Приготовления

source: We wont cover how to host Docker registry in this manual, but consider following options:
ru: Хостинг репозитория Docker выходит за рамки данного руководства, но мы предлагаем вам ознакомится со следующими опциями

source: host manually, see `Docker Registry Docs`__ for info
ru: настройте самостоятельно, см. `Docker Registry Docs`__

source: registry is included in latest releases of GitLab CE/EE (see docs__)
ru: репозиторий Docker является встроенной функциональностю в последних релизахGitLab CE/EE (см. `документацию`__)

source: you can buy private registry hosting from:
ru: Также вы можете купить услугу хостинга приватных репозиториев Docker у провайдеров:

source: Or you can rely on CRPLab infrastructure and pull images from our own registry (default)
ru: Или вы можете использовать инфраструктуру CRPLab для загрузки образов систем от разработчиков.

source: To proceed you need to add your docker registry credentials to Kubernetes, so images could be pulled and containers/services could be launched.
ru: Чтобы продолжить вам необходимо добавить секрет доступа к docker registry в Kubernetes для того что бы Kubernetes мог загрузить образы и запустить основанные на них контейнеры/сервисы

source: Airgapped (physically isolated) installations are not covered by this manual.
ru: Изолированная устанока системы не рассматривается в данном руководстве

source: To setup credentials to your registry of choice, first you need to obtain them from the registry provider, in case of registry hosted by CRPLab LLC you can receive credentials by mailing your manager.
ru: Чтобы добавить секрет доступа к выбранному вами Docker registry в Kubernetes, его необходимо получить у поставщиков сервиса, для этого обратитесь к соотвествующей документации вашего поставщика. В случае если вы пользуетесь сервисами CRPLab - вы можете получить доступ обратившись к вашему менеджеру.

source: Once you have acquired credentials from respective provider create a secret in Kubernetes using following command:
ru: После того как секрет у вас, выполните следующие команды чтобы добавить его в Kubernetes:

source: OR refer to this documentation__ for other options how to setup access to private registry in Kubernetes
ru: Или обратитесь к документации__ для иных способов настройки доступа в приватный репозиторий Docker

source: Make sure to name secret "crplab", otherwise you will have to supply different secret name to all custom helm charts below
ru: Удостоверьтесь что задали имя секрета "crplab", иначе вам придется передавать новое имя секрета во все конфигурации сервисов (helm chart) используемые далее

source: Building images
ru: Сборка образов ПО

source: This section is of interest only if you have been provided with access to source codes and wish to build artifacts (docker images) yourself. Otherwise - stick with images provided by developers of the system
ru: Данная секция будет интересна только в случае если у вас есть доступ к исходным кодам и желание/необходимость собирать образа самостоятельно. В противном случае - используйте образа поставляемые разработчиком ПО.

source: docker installed
ru: docker установлен

source: access to docker registry configured on your host
ru: доступ к docker registry сконфигурирован на вашей машине

source: access to docker registry configured in Kubernetes
ru: доступ к docker registry сконфигурирован в Kubernetes

source: The only images you need to build are these of custom services developed at CRPLab LLC, these are included in charts:
ru: Только образа сервисов созданных CRPLab нуждаются в сборке, остальные образа публичны. Образа нуждающиеся в сборке входят в следующие конфигурации:

source: In general to build images you need to execute following commands:
ru: В целом все образы строятся одинаково, вам необходимо выполнить следующие команды:

source: An example, how images are built in our CI:
ru: Пример того, как собираются образы в нашем CI:

source: You'll find exact instructions on how to build specific images in README's located with the source-codes of respective services.
ru: Вы найдете точные команды для сборки конкретных образов в README соответствующих репозиториях.

source: Also, some services contain a `gitlab-ci.yaml` - configuration for GitLab CI which builds images continuously, you can use it as a reference to understand how images are built.
ru: Так же в некоторых репозиториях присутствует файл `gitlab-ci.yaml` - конфигурация GitLab CI исполуемая нами для сборки образов, вы можете использовать ее как пример чтобы понять как строятся образы конкретных сервисов

source: Cluster-Wide services install
ru: Исталяция общих сервисов

source: To provide persistent storage to MongoDB on SSD if you dont have "fast" class volumes provided by your platform and Kubernetes via "dynamic-provisioning" you may need to setup SSD-backed NFS share.
ru: Чтобы предоставить персистентное хранилище для MongoDB на SSD дисках, если у вас нет volume'ов базирующихся на SSD в OpenStack и доступных для автомонтирования в Kubernetes, вам необходимо огранизовать NFS шеринг SSD диска.

source: When done, announce it to Kubernetes using following manifest and command (alter as necessary):
ru: Когда сделаете это, анносируйте NFS export в Kubernetes используя следующий манифест и команду (измените содержимое манифеста чтобы он соответствовал вашему NFS export'у)

source: After, you can provision MondoDB itself:
ru: После этого вы можете развернуть MongoDB, используя команды:

source: Optionally you could install a control panel for Kafka
ru: Опционально вы можете установить панель управления очередями Kafka

source: Kafka-Manager has some control over Kafka and may expose security risks if installed on production system exposed to open networks
ru: Kafka-Manager имеет весьма широкий контроль над Kafka и может представлять риски безопастности если доступ к нему не закрыт в продакшен системах

source: Download consul helm git repo prior execution
ru: Загрузите helm конфигурацию для Consul из репозитория перед тем как начать.

source: Install helm chart
ru: Установите helm chart

source: Installation of this component is completely optional as it serves only as informational panel.
ru: Исталяция данного компонента полностью опциональна, так как он служит исключительно информационным целям.

source: Installation of this component is optional.
ru: Инсталяция данного компонента опциональна.

source: Be careful if you choose to install this component, as it has admin privileges over cluster and can expose potential security risks.
ru: Будьте осторожны устанавливая данный компонент, он имеет привилегии администратора кластера и может вызвать угрозу безопастности инсталяции.

source: Buldozer services installation
ru: Установка Buldozer

source: In fact it is pretty simple, all you have to do is install buldozer-platform chart as you did with the rest of them
ru: Все что необходимо сделать - это поставить следующую конфигурацию helm chart:

source: Make sure you reviewed values.yml and applied custom values to adjust the installation to your cluster (see below).
ru: Убедитесь что значения в values.yaml соответствуют вашей инсталяции, или измените их соответствующе (см. ниже).

source: Buldozer Helm configuration
ru: Конфигурация helm chart для Buldozer

source: Things you should pre-configure yourself or note during the installation of other components, such services, DNS names of in-cluster components and IPs for infrastructure services located "below" Kubernetes layer, which should be referenced in **buldozer helm values**.
ru: Компоненты которые вы должны настроить самостоятельно, или отметить при исталяции согласно руководству выше, такие как имена сервисов, DNS-имена, IP адреса инфраструктурных элементов ниже уровня Kubernetes, что необходимо передать в конфигурацию helm chart для Buldozer

source: Examine values.yaml for formats and other useful comments on how that should be configured
ru: Обратитесь к values.yaml для того чтобы посмотреть примеры, формат значений и полезные коментарии о том как эти значения должны быть сконфигурированы.

source: Important Values
ru: Важные элементы

source: value ref
ru: переменная

source: description
ru: описание

source: configures NFS volume pod-lifetime binding
ru: настраивает временные биндинги NFS для разделяемого хранилища моделей

source: host IP or DNS name of NFS node should be accessible from all nodes in the cluster
ru: IP адрес хоста или DNS имя ноды хостящей NFS, должна быть доступна со всех нод кластера.

source: exported directory of NFS node should be r/w accessible for NFS client
ru: директория экспортируемая NFS (имя экспорта) - должна быть доступна на чтение и запись.

source: host IP or DNS name of NFS node should be accessible from all nodes in the cluster, must match `shared_fs.nfs_server`
ru: IP адрес хоста или DNS имя ноды хостящей NFS, должна быть доступна со всех нод кластера. должно совпадать с `shared_fs.nfs_server`

source: exported directory of NFS node should be r/w accessible for NFS client must match `shared_fs.nfs_path`
ru: директория экспортируемая NFS (имя экспорта) - должна быть доступна на чтение и запись. должно совпадать с `shared_fs.nfs_path`

source: these variables are provided to all pods of Buldozer and hold common DSNs for related services
ru: переменные окружения передаваемые всем подам сервисов Buldozer, содержат общие настройки доступа

source: DSN of mongodb there services store their data (usually it is deployed in-cluster as mentioned above)
ru: DSN для доступа к MongoDB

source: DSN of consul there workspaces store their runtime configuration and post their healthchecks to. (usually it is deployed in-cluster as mentioned above)
ru: DSN для доступа к Consul

source: DSN of kafka installation which processes all event-streams between workspaces (usually it is deployed in-cluster as mentioned above)
ru: DSN для доступа к Kafka

source: DSN for Sentry error reporting, optional. (Sentry could be installed in-cluster or elsewhere). use "legacy" DSN format here (see Sentry UI to retrieve it)
ru: DSN для доступа к Sentry (опционально)

source: GIS Services Installation
ru: Исталяция сервисов ГИС

source: Make sure you reviewed values.yml and applied custom values to adjust the installation to your cluster.
ru: Убедитесь что значения в values.yaml соответствуют вашей инсталяции, или измените их соответствующе.
