Repository: carrotFoxx/services
Catalog: docs/locale/*/LC_MESSAGES/installation_manual.po
Languages: ru

source: Infrastructure Installation Manual
ru: Руководство по настройке инфраструктуры

source: Prerequisites:
ru: Предусловия:

source: you have git and ssh installed
ru: git и ssh установлены

source: download the infrastructure repository from git
ru: репозиторий с исходными кодами и конфигурациями инфарструктуры скачан из git

source: you have OpenStack cluster up and running
ru: кластер OpenStack готов к работе

source: All commands described in this manual are expected to be run stating at the root of infrastructure repository.
ru: Все команды описаннные в данном мануале предпологается выполнять в корневой папке репозитория

source: Hardware/Platform Requirements
ru: Требования к оборудованию

source: Requirements for a hardware platform.
ru: Требования к оборудованию

source: Minimal (Single Node)
ru: Минимальные (Однонодовая исталяция)

source: This will be sufficient to get system up and running to poke around.
ru: Этого достаточно для запуска системы "для экспериментов"

source: Optimal (Single or Multi Node)
ru: Оптимальные

source: Logical Layout Requirements
ru: Требования к логическим ресурсам

source: Above mentioned resources should be presented to system in following way (multi-node installation)
ru: Физические ресурсы описаные выше должны быть представлены системе следующим образов (много-нодовая инсталяция)

source: Node Type
ru: Тип ноды

source: LCPUs
ru: Логических CPU

source: No other basic requirements enforced.
ru: Иных базовых требований не предъявляется

source: Node setup
ru: Подготовка нод к работе

source: Your machine setup
ru: Подготовка к работе исходной машины

source: We use `Ansible` to manage node software, recipes (playbooks) are contained in the repo.
ru: Мы используем `Ansible` для менеджмента ПО на нодах, все рецепты (playbooks) находятся в инфраструктурном репозитории

source: To setup it on your machine - follow it's installation instructions, which could be found at `docs.ansible.com`__
ru: Чтобы исталировать его на вашей машине - обратитесь к руководству по инсталяции на сайте `docs.ansible.com`__

source: We use kubectl and helm to control deployment of services and supporting software.
ru: Мы используем kubectl и helm для установки ПО в Kubernetes

source: To setup kubectl - follow installation guide from `kubernetes.io`__
ru: Для установки kubectl - обратитесь к руководству по инсталяции на `kubernetes.io`__

source: To setup helm - follow installation guide from `docs.helm.sh`__
ru: Для установки helm - обратитесь к руководству по инсталяции на `docs.helm.sh`__

source: Setup nodes
ru: Подготовка нод кластера

source: Preparing your machine
ru: Подготовка на исходной машине

source: To begin, you need to enlist all nodes provisioned in the ansible inventory file.
ru: Чтобы начать вам необходимо составить инвентарь ваших нод в файле для `ansible`.

source: Refer to `inventory documentation at docs.ansible.com`__ for advanced usage.
ru: Обратитесь к `документации инвентаря`__ для продвинутого использования.

source: Below is an example inventory configuration for setup of
ru: Ниже - пример файла инвентаря для:

source: You should enlist nodes with aliases as in the example to make sure that all works as expected
ru: Вам следует использовать алиасы нод как в примере, чтобы все работало как ожидается.

source: Make sure all nodes are reachable from your machine use key-based ssh auth, and are registered in your machines `known_hosts`.
ru: Убедитесь в том что все ноды доступны с исходной машины используя ключевую (без-парольную) авторизацию SSH, и зарегистрированы на исходной машине в `~/.ssh/known_hosts`.

source: You can make sure of it by simply logging in on each of them via:
ru: Вы можете убедится в этом просто зайдя на каждую машину вручную:

source: and accepting node's key as known.
ru: и приняв ключ ноды как известный.

source: Setting up nodes and deploying Rancher
ru: Установка необходимого ПО и Rancher на ноды

source: you have ansible, kubectl and helm installed
ru: ansible, kubectl и helm установлены

source: you have inventory.ini file with nodes you set up
ru: у вас есть inventory.ini со всеми вашими нодами

source: To setup required software on the nodes, make sure all of them have access to the internet and then execute following from your machine:
ru: Для установки всего необходимого ПО на ноды, убедитесь что все они имеют доступ в интернет и тогда - выполните команды ниже на исходной машине:

source: and wait for it to finish.
ru: подождите пока все закончится.

source: if something failed, run it again - it is idempotent
ru: если чтото упало, попробуйте запустить снова - процесс инсталяции идемпотентный

source: if you use non-default private key or non-direct network access to nodes, refer to `docs.ansible.com`_ to setup it and lookup options for `ansible-playbook` command required to make it work.
ru: Если вы используете не стандартный ключ или ноды не доступны напрямую с вашей исходной машины, обратитесь к `docs.ansible.com`_ чтобы настроить ansible для работы в вашей конфигурации.

source: Also take a look at this article__, explaining how to setup ansible to access nodes through jump host or bastion
ru: Так же посмотрите эту статью__, объясняющую как настроить ansible для работы через бастион

source: Also you need to setup shared storage node(s), to do so, apply next playbook:
ru: Еще необходимо настроить разделяемую ноду хранилище, чтобы сделать это - примените следующий рецепт:

source: Outcome:
ru: Результат:

source: you have nodes software set up
ru: вы установили на ноды все нужное ПО

source: rancher server software is running on the `control` node
ru: ПО Rancher Server установлено и работает на `control` ноде

source: you can access it via https://<rancher-server-ip-addr>:8443
ru: вы можете получить к нему доступ `через https://<rancher-server-ip-addr>:8443`

source: Setup Rancher
ru: Настройка Rancher

source: you have nodes running and set up
ru: ваши ноды подготовлены к работе

source: rancher server software is running and accessible
ru: ПО Rancher установлено и доступно

source: Follow `this manual on rancher.com`__ to log in and setup Rancher.
ru: Следуйте `руководству на rancher.com`__ чтобы войти и инициализировать Rancher

source: In short:
ru: Если коротко:

source: Open a web browser and enter the IP address of rancher-server: `https://rancher-server:8443` (replace `rancher-server` with IP if needed)
ru: Откройте веб-браузер и наберите адрес по которому у вас доступно ПО Rancher: `https://rancher-server:8443` (замените rancher-server на IP если необходимо)

source: When prompted, create a password for the default admin account.
ru: Когда спросят, задайте пароль для записи администратора.

source: Set the Rancher server URL, the URL can either be an IP address or a host name. However, each node added to your cluster must be able to connect to this URL.
ru: Сконфигурируйте URL сервера Rancher, этот URL может быть либо IP адресом либо DNS именем, но каждая нода кластера должна иметь возможность присоедениться по этому адресу.

source: If you use a hostname in the URL, this hostname must be resolvable by DNS on the nodes you want to add to you cluster.
ru: Если вы используете имя хоста или DNS - имейте ввиду что оно должно быть разрешаемо (решения с /etc/hosts не достаточно!)

source: you have Rancher UI fully operating
ru: вы инициализировали Rancher UI

source: Setup Kubernetes cluster via Rancher
ru: Развертывание и настройка кластера Kubernetes через Rancher

source: you have running Racher and Racher UI ready
ru: Rancher/UI настроены и готовы к работе

source: you have nodes set up and ready
ru: ноды подготовлены к работе

source: you have infrastructure provider ready (openstack or similar, supported by Rancher)
ru: провайдер инфраструктуры готов и настроен (openstack или другое решение, поддерживаемое Rancher)

source: OpenStack API is reachable from all nodes
ru: API OpenStack доступно со всех машин кластера

source: Go to Rancher UI (`https://<rancher-server-ip-addr>:8443`)
ru: Перейдите к Rancher UI (`https://<rancher-server-ip-addr>:8443`)

source: From the **Clusters** page, click **Add Cluster**.
ru: Со страницы **Clusters** выберите **Add Cluster**.

source: Choose **Custom**.
ru: Выберите **Custom**.

source: Enter a **Cluster Name**.
ru: Введите **Cluster Name**.

source: Edit the **Cluster Options**, switch to **Edit as YAML** view, and paste the contents of `rancher/rancher-cloud.conf.yaml` instead of text contained there.
ru: Отредактируйте **Cluster Options**, переключитесь на **Edit as YAML** и вставте содержимое файла `rancher/rancher-cloud.conf.yaml` вместо имеющегося текста.

source: Make sure to alter settings, credentials and URL for OpenStack API under `cloud_provider.openstackCloudProvider.**` to your installation details.
ru: Обязательно отредактируйте опции после вставки, дабы они соответсвовали настройкам вашего кластера особенно раздел `cloud_provider.openstackCloudProvider.**`

source: Pay special attention to:
ru: Обратите особое внимание на:

source: More info on options represented and how to setup them you can find in `Rancher/RKE Documentation`__.
ru: Больше информации об опциях конфигурации и о том как их настроить вы можете найти в документации `Rancher/RKE`__.

source: Afterwards, switch back to form with **Edit as Form** button, and then select **Kubernetes version** = `1.11.x...` (some flavor of 1.11)
ru: Затем, переключитесь обратно, нажав **Edit as Form**, и выберите версию Kubernetes 1.11.хх (вариат предложеный селектором)

source: Click **Next**.
ru: Нажмите **Next**

source: From **Node Role**, select all the roles: **etcd**, **Control**, and **Worker**.
ru: Из **Node Role** выберите все роли: **etcd**, **Control**, и **Worker**.

source: **Optional**: Rancher auto-detects the IP addresses used for Rancher communication and cluster communication. You can override these using `Public Address` and `Internal Address` in the **Node Address** section.
ru: **Опционально**: Rancher автоматически определяет IP адреса используемые для коммуникации с Rancher и для коммуникации внутри кластера Kubernetes, вы можете переопределить их используя поля `Public Address` и `Internal Address` в секции **Node Address**.

source: Skip the **Labels** stuff. It’s not important for now.
ru: Пропустите секцию **Labels**. Она сейчас не понадобится.

source: Copy the command displayed on screen to your clipboard.
ru: Скопируйте команду отображенную на экране.

source: Log in to your Linux host(s) using your preferred shell, such as PuTTy or a remote Terminal connection. Run the command copied to your clipboard.
ru: Залогинтесь на вашу Linux ноду(ы) через SSH и выполните скопированную команду там.

source: **OR**
ru: **ИЛИ**

source: You can use following command to quickly launch node registration process on all/selected nodes:
ru: Вы можете использовать следующую команду ansible для выполнения скопированной команды Rancher на всех/выбранных нодах:

source: Make sure you register either 1 or 3 nodes with control-plane roles (both **etcd** and **control-plane**/**Control**) and all or rest of them as **worker**
ru: Убедитесь что зарегистрировали либо 1 либо 3 ноды с ролями управления (и **etcd** и **control-plane**/**Control**) и все или оставшиеся ноды зарегистрированы с ролью **Worker**

source: When you finish running the command on your Linux host(s), click **Done**.
ru: После того как вы запустили команду на всех нужных ностах, нажмите **Done**.

source: Up-to-date official manual on that part could be located `here`__
ru: Официальное руководство по этой части можно увидеть здесь__.

source: You can use other options provided by Rancher to setup Kubernetes Cluster, or even dont use Rancher at all, provision Kubernetes on bare-metal or using services like Istio, AWS EKS or Microsoft/Asure AKS.
ru: Вы можете использовать иные опции поддерживаемые Rancher чтобы развернуть Kubernetes, или же не использовать Rancher вовсе, развернуть Kubernetes вручную или используя других провайдеров - таких как Istio, AWS EKS или Microsoft/Asure AKS.

source: Rancher is not required for Buldozer to operate.
ru: Rancher не является необходимым компонентом для функционирования Buldozer.

source: However make sure Kubernetes has access to dynamically provisioned volumes (in case of openstack they are baked by openstack-cinder, other options could be: glusterfs, ceph, etc.. for full list of options head to `kubernetes documentation`__ and look for drivers supporting "dynamic provisioning")
ru: Тем не менее имейте ввиду что Kubernetes должен иметь возможность динамически аллоцировать простраства хранения (в случае с openstack это обеспечивается через openstack-cinder, другими вариантами могут быть:glusterfs, ceph и прочие системы хранения, полный список поддерживаемых вариантов вы найдете в `документации Kubernetes`__, из всех представленных подходят те что поддерживают "динамическое аллоцирование")

source: Once you have done with that - wait for cluster to become **Available** in Rancher UI (you will see its status either on main page or looking at **Nodes** tab inside created cluster entry).
ru: После, дождитесь пока статус кластера станет **Active/Available** в Rancher UI

source: you have Kubernetes cluster ready and running
ru: Kubernetes готов к работе

source: Segmenting your cluster
ru: Сегментация кластера

source: you have kubectl tool configured to access your cluster
ru: kubectl установлен и настроен на доступ к вашенму кластеру Kubernetes

source: In order to distribute load over the cluster and prevent conflicting interest over resources certain components have additional scheduling requirements which are based on labels of nodes and pods inside Kubernetes.
ru: Чтобы более точно распределять нагрузку по кластеру и предотврать гонку за ресурсами внутри кластера, некоторые компоненты используют дополнительные правила распределения которые базируются на том как помечены ноды кластера

source: To get it working you should label some of the nodes according to following table:
ru: Вам следует пометить ноды кластера соответственно следующей таблице:

source: label
ru: метка

source: value
ru: значение

source: amount
ru: колличество нод

source: To list all nodes registered in Kubernetes:
ru: Чтобы вывести все ноды известные Kubernetes:

source: To label node use following command:
ru: Чтобы отметить ноду, используйте следующую команду:

source: you have nodes labeled in Kubernetes according to recommendations
ru: ноды отмечены соответствующим образом.

source: Setup tooling
ru: Настройка утилит

source: Kubernetes cluster up and running
ru: Kubernetes готов к работе

source: Rancher/UI up and running
ru: Rancher/UI готов к работе

source: Get configuration for kubectl from Rancher UI by heading to cluster you have created in Rancher UI and selecting:
ru: Чтобы получить конфигурацию kubectl из Rancher UI перейдите к вашему кластеру и выберите:

source: then follow instructions on the UI and put contents presented to `~/.kube/config`
ru: Следуйте инструкции в Rancher UI и поместите содержимое конфигурации в файл `~/.kube/config` на вашей(исходной) машине

source: If you are not using Rancher/UI, you have to obtain kube-config manually, and if you setup Kubernetes by other means, it is assumable that you now how to do this at that point
ru: Если вы не используете Rancher/UI вы должны написать/раздобыть конфигурацию kubectl самостоятельно, и раз уж вы дошли до этого момента - для вас это не должно быть сложно.

source: Helm and Tiller
ru: Helm и Tiller

source: kubectl configured to access your cluster
ru: kubectl настроен на работу с вашим кластером Kubernetes

source: helm installed on your machine
ru: helm установлен на вашей машине

source: Run following command to setup Tiller in your cluster:
ru: Выполните следующие команды чтобы установить Tiller в вашем кластере:

source: Tiller installed in your cluster
ru: Tiller установлен в вашем кластере

source: helm is ready to install charts to your cluster
ru: helm готов к работе и исталяции чартов в ваш кластер
