Repository: carrotFoxx/services
Catalog: docs/locale/*/LC_MESSAGES/quickstart_manual.po
Languages: ru

source: Quickstart Manual
ru: Вводное руководство

source: Definitions
ru: Определения

source: Application
ru: Приложение

source: an abstraction which defines environment and software suite to utilize the Model with.
ru: абстракция определяющая окружение и программное обеспечение с которым можно утилизировать Модель

source: Model
ru: Модель

source: a collection of settings typically represented as a config file for a software suite represented as Application.
ru: набор свойств обычно предствленный в виде файла для программного пакета определенного Приложением

source: an abstraction which defines runtime, by combining Application and Model in same environment, and provides options to stream data in and out for processing
ru: абстрация определяющая состав исполнящей среды через связь Приложения и Модели в общем окружении и предоствляющая возможность передавать потоки событий для обработки в обе стороны

source: Working with Applications
ru: Работа с Приложениями

source: Application Structure
ru: Структура объекта Приложения

source: object id
ru: идентификатор объекта

source: current object version
ru: текущая версия объекта

source: float value of unixtime ms then object was initially created
ru: время создания объекта (unix timestamp)

source: float value of unixtime ms then object was updated last time
ru: время последнего обновления объекта (unix timestamp)

source: id of a user who created the object
ru: идентификатор создателя объекта

source: object user-defined name
ru: имя данное пользователем

source: object user-defined description
ru: описание данное пользователем

source: this is a system property, a link to a binary attachment, optionally uploaded for an object
ru: системное свойство определяющее ссылку на бинарное приложение, опционально загруженное для объекта

source: a dict of user-defined key-value pairs to be added as system environment variables on the runtime
ru: словарь определенных пользователем пар ключ-значение, которые будут добавлены в системное окружение при инициализации исполняемой среды

source: a environment base to be used, currently it is a docker image id or reference, the only supported value is `buldozer_subordinate:latest`
ru: базовый образ окружения, которое будет использовано для запуска приложения, в текущий момент - это ссылка/идентификатор образа Docker, значения отличные от `buldozer_subordinate:latest` пока не поддерживаются

source: Creating an Application
ru: Создание Приложения

source: to create an application use following request
ru: чтобы создать объект Приложения достаточно выполнить следующий запрос

source: **example request**
ru: **пример запроса**

source: **example response**
ru: **пример ответа**

source: Request JSON Object
ru: JSON объект запроса

source: Application object
ru: объект Приложения

source: Response JSON Object
ru: JSON объект ответа

source: created application uid
ru: идентификатор созданного Приложения

source: application and models API uses versions passed explicitly in *X-Version* and *X-If-Version* headers to ensure you are working with object you intended to.
ru: API приложений и моделей использует версии передаваемые явно в заголовках *X-Version* и *X-If-Version* чтобы удостоверится что вы работаете именно с тем объектом с которым вы изначально намеревались работать

source: Listing existing Applications
ru: Просмотр существующих Приложений

source: to list just created application use:
ru: чтобы посмотреть созданные приложения используйте следующий запрос

source: Response JSON Array of Objects
ru: JSON массив объектов ответа

source: Altering existing Application
ru: Изменение существующего Приложения

source: altered Application object
ru: измененный объект приложения

source: Commit app version to archive
ru: Передача версии приложения в архив

source: In order to use application as an environment and provision it on the infrastructure it is required to persist a copy of its current state to archive, which maintains a history of changes and provides reliable access to all versions of application for internal services in order to keep ongoing changes isolated from running instances and provide uninterrupted service and consistency.
ru: Чтобы использовать приложение и разместить его в инфраструктуре необходимо сохранить неизменяемую копию его состояния в архив который содержит всюисторию измений и предоставляет внутренним сервисам надежный доступ к ней, таким образом текущий процесс изменений изолируется от активных истансов, что позволяет предоставлять непрерывный сервис и гарантию консистентности

source: To commit application version to archive, then you finished applying changes and ready to do so, use following request:
ru: Чтобы отправить версию приложения в архив, когда вы закончите вносить изменения и будете готовы это сделать, воспользуйтесь следующим запросом:

source: number of version in archive
ru: номер версии в архиве

source: Removing application
ru: Удаление приложения

source: application instance can be removed using following request
ru: объекты приложений могут быть удалены используя следующий запрос:

source: archive records will not be removed
ru: архивные записи удалены не будут

source: Status Codes
ru: Коды ответа

source: resource successfully removed
ru: ресурс успешно удален

source: Working with Models
ru: Работа с Моделями

source: Model Structure
ru: Структура Модели

source: Model API is structured in the same way as the Application API, so most queries are the same, except for the root path and object passed in POST and PUT, just switch it to Model structure.
ru: API Моделей структурирован точно так же как и API Приложений, так что большинство запросов точно такие же, за исключением корневого пути и объектов предаваемых в теле запросов POST и PUT, просто поменяйте их согласно структуре Модели

source: We will only cover the differences and additional APIs available.
ru: Далее описаны лишь отличия и дополнительные доступные API

source: Uploading Model Artifact
ru: Загрузка артефакта Модели

source: This is file upload endpoint, 2 different upload mechanics are supported.
ru: Это ендпоинт для загрузки файлов, поддерживается 2 механизма загрузки

source: http multipart/data (standard file upload as per RFC 7578)
ru: http multipart/data согласно стандарту RFC7578

source: body stream (streaming upload) - takes entire body of request as a file contents
ru: потоковая загрузка, использует все содержимое тела запроса и записывает его в файл

source: **example rfc7578 upload (simplified)**
ru: **пример загрузки согласно RFC7578 (упрощенный)**

source: **example stream upload**
ru: **пример потоковой загрузки**

source: Utilizing Workspaces
ru: Использование Рабочих пространств

source: Workspaces are main configuration point to actually use the platform for things it is designed to.
ru: Рабочие пространства - это основная точка конфигурации чтобы использовать платформу для тех вещей для которых она создана

source: Applications and Model are just definitions utilized by Workspace to provision runtime which processes data streams and allows to route them in, out and from one workspace to another.
ru: Приложения и Модели это лишь определения используемые Рабочим пространством для создания исполняемого окружения которое обрабатывает потоки данных и направлять их в, из и от одного окружения к другому

source: Workspace Structure
ru: Структура объекта Рабочего окружения

source: application to bind in runtime
ru: приложение привязываемое в исполняемую среду

source: application version to bind
ru: версия приложения привязываемого в исполняемою среду

source: model to bind in runtime
ru: модель привязываемая в исполняемую среду

source: model version to bind
ru: версия модели привязываемого в исполняемую среду

source: internal runtime id (may refer to Docker container, Kubernetes pod or OpenStack VM)
ru: внутренний идентификатор исполняемой среды (может относится к контейнеру Docker, Kubernetes Pod'у или виртуальной машине OpenStack)

source: Creating Workspace
ru: Создание Рабочего окружения

source: Workspace object
ru: объект Рабочего окружения

source: created workspace uid
ru: идентификатор созданнног рабочего окружения

source: Routing Kafka streams to and from Workspace
ru: Направление потоков событий Kafka в и из рабочего окружения

source: kafka topic to consume data from
ru: топик kafka поставляющий входные данные

source: kafka topic to write processed data to
ru: топик kafka принимающий результаты обработки

source: route config stored in coordinator
ru: конфигурация маршрутов сохранена в координаторе

source: incremental update number (incremented each time you update routing config)
ru: инкрементальный *желаемый* номер обновления конфигурации (каждый раз когда вы обновляете конфигурацию - он увеличивается)

source: incremental adopted number (equality of *desired* and *adopted* versions indicates that config was successfully provisioned to runtime)
ru: номер адаптированного обновления (равенство *желаемой* и *адаптируемой* версий свидетельствует об успешном применении конфигурации исполняемой средой)
